[{
        "senderName": "Emma Mathews",
        "senderEmailID": "FredMathews@gmail.com",
        "subject": "To inform you and introduce you to our new marketing manager of the marketing department",
        "body": "Respected Mr. Sarvesh,\nThis is to bring to your notice that we have hired a new marketing manager in our company to lead the marketing department of our company. His name if Mr. Greg Aniston and he has readily accepted our offer to lead the sales and marketing team. Mr. Aniston is a well known marketing expert and has agreed to give in his best to our company ‘Laila Inc.’ Ever since Mr. Tim West left the job position due to personal reasons, this position has been up for grabs. We finally found our man in Mr. Aniston. He has worked for ‘Pearl footwear’ for over 7 years as the marketing manager and won several acclaims and even wrote a column for this company in the ‘Marketing times’ newspaper. He is extremely dedicated to his work and is very hard working. He can be reached easily and has been known to build a good rapport with fellow colleagues and employees.\nHope to see you at the welcome party at 5 pm in the company seminar room on 20th of this month.\n\nFred Mathews",
        "type": "P",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "29-11-2021",
        "time": "19:52",
        "isFavourite": false,
        "isMarked": true,
        "profileImage": "Emma"
    },
    {
        "senderName": "Emma Mathews",
        "senderEmailID": "Emma@gmail.com",
        "subject": "New job opening in the marketing department of our company Mach and Beth",
        "body": "Respected Mr. Sarvesh,\nI would like to inform you that our company has announced the opening for a new job position of a junior marketing manager. This job opening was decided because our previous junior marketing manager recently resigned and we weren’t able to fit anybody else in that position. I am providing you with the details of the company and the job profile as follows. Please find an attached interview document which you need to fill in and send back to us.\n\nOur company is an IT solution organisation which has been developing computer solutions and softwares for different companies as per their needs and specifications. This job position will require the candidate to develop marketing models so that our developed softwares can be sold to many different companies. He/she would be required to meet with potential clients and present the products in a good light. The salary is good in this job and there is a good exposure scope for the employee to build a career graph.\n\nIf you are interested in any way, then come down for the interview with a copy of your resume and in a formal dress code.\n\nRegards,\nRichard Dawson",
        "type": "P",
        "cc": "",
        "hasAttachment": true,
        "attachmentName":"JobDescription.pdf",
        "date": "26-11-2021",
        "time": "09:12",
        "isFavourite": false,
        "isMarked": true,
        "profileImage": "Emma"
    },

    {
        "senderName": "Maxwell Iaconis",
        "senderEmailID": "Maxwell@gmail.com",
        "subject": "Thanking for conducting the Interview for the post of Office Manager",
        "body": "Hello Mr. Sarvesh,\nSir, I, Fred Nicholson would like to express my gratitude through this email and would like to thank you for taking out your time from the busy schedule to interview me for the post of the Office Manager in your company. I appeared for the interview on the 24th March this year and am really obliged that I was given a chance to become a part of this great organisation.\nSir, I would like to remind you that I have worked previously for two companies at the job position of the office manager and would prove to be a great employee for the company. I would love to become a part of your team and would like to thank you again for selecting my resume out of the list of many other talented candidates.\n\nRegards,\nMaxwell",
        "type": "P",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "01-12-2021",
        "time": "18:07",
        "isFavourite": true,
        "isMarked": true,
        "profileImage": "Maxwell"
    }

    ,
    {
        "senderName": "Suraj Gupta",
        "senderEmailID": "Suraj@email.com",
        "subject": "Launch of the Blueberry Phone at GBay",
        "body": "Dear Members,\nIt has been such a great journey for the last 2 years. We have achieved so much and gained so much from you. Through your continuous support we have been able to establish ourselves as one of the best online sales forum. Today, we have been able to get the best of clients to improve our standards and to offer more to you.\nThe newly launched Blueberry phone is now available with us at an extremely competitive price. There are more than a dozen new models that have been updated. Please visit the website: offers@gbay.com in order to connect with us and get a glimpse of your favorite phones at attractive prices.\nSpecial offer for member: 25% discount of the first 5 purchases of the Blueberry. SO what are you waiting for? Grab the offer right NOW.\n\nThanks & Regards\nTeam GBay",
        "type": "P",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "23-11-2021",
        "time": "7:23",
        "isFavourite": false,
        "isMarked": true,
        "profileImage": "Suraj"
    },

    {
        "senderName": "Suraj Gupta",
        "senderEmailID": "Suraj@email.com",
        "subject": "Grab your Maximus Visa Credit Card today",
        "body": "Hello Members,\nThrough your continuous support we have been able to establish ourselves as one of the best online sales forum. Today, we have been able to get the best of clients to improve our standards and to offer more to you.\nThe newly launched Blueberry phone is now available with us at an extremely competitive price. There are more than a dozen new models that have been updated. Please visit the website: offers@gbay.com in order to connect with us and get a glimpse of your favorite phones at attractive prices.\nSpecial offer for member: 25% discount of the first 5 purchases of the Blueberry. SO what are you waiting for? Grab the offer right NOW.\n\nThanks & Regards\nTeam GBay",
        "type": "P",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "31-11-2021",
        "time": "12:45",
        "isFavourite": false,
        "isMarked": false,
        "profileImage": "Suraj"
    },
    {
        "senderName": "George Groza",
        "senderEmailID": "George@email.com",
        "subject": "50% off on Car Insurance Renewal",
        "body": "Greetings Sarvesh,\nToday, we have been able to get the best of clients to improve our standards and to offer more to you.\nThe newly launched Blueberry phone is now available with us at an extremely competitive price. There are more than a dozen new models that have been updated. Please visit the website: offers@gbay.com in order to connect with us and get a glimpse of your favorite phones at attractive prices.\nSpecial offer for member: 25% discount of the first 5 purchases of the Blueberry. SO what are you waiting for? Grab the offer right NOW.\n\nThanks & Regards\nTRex Insurance",
        "type": "P",
        "cc": "",
        "hasAttachment": true,
        "attachmentName":"InsuranceQuote.pdf",
        "date": "23-10-2021",
        "time": "7:23",
        "isFavourite": true,
        "isMarked": true,
        "profileImage": "George"
    },
    {
        "senderName": "Lisa",
        "senderEmailID": "Lisa@email.com",
        "subject": "Launch of Big Billion Day Sale",
        "body": "Dear Sarvesh,\nGrab latest and best deals on electronics, clothes and home appliances at Amazon.in Big Billion Day. More than 1000+ Products to choose from. Penguin phone is now available with us at an extremely competitive price. There are more than a dozen new models that have been updated. Please visit the website: offers@gbay.com in order to connect with us and get a glimpse of your favorite phones at attractive prices.\nSpecial offer for member: 45% discount of the first 10 purchases of the Blueberry. SO what are you waiting for? Grab the offer right NOW.\n\nThanks & Regards\nTeam Amazon",
        "type": "P",
        "cc": "",
        "hasAttachment": true,
        "attachmentName":"AmazongDeals.png",
        "date": "31-09-2021",
        "time": "12:45",
        "isFavourite": false,
        "isMarked": false,
        "profileImage": "Lisa"
    },
    {
        "senderName": "Raya Rosewill",
        "senderEmailID": "Raya@email.com",
        "subject": "Congratulations on your promotion !! Lets catch up.",
        "body": "Hey Sarvesh,\nLet's catchup on saturday and celebrate. I will inform rest of our friends. Let's decide about the venu at work.\n\nTake Care,\n Raya",
        "type": "S",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "12-11-2021",
        "time": "9:37",
        "isFavourite": false,
        "isMarked": true,
        "profileImage": "Raya"
    },
    {
        "senderName": "Alex Homes",
        "senderEmailID": "Alex@email.com",
        "subject": "Regarding finalizing project idea.",
        "body": "Hi Sarvesh,\nLet's catchup on coming Friday and finalize our project idea for the competition. I will inform rest of our teammates about it.\n\nThanks,\n Alex",
        "type": "S",
        "cc": "",
        "hasAttachment": false,
        "attachmentName":"",
        "date": "28-12-2021",
        "time": "10:25",
        "isFavourite": true,
        "isMarked": true,
        "profileImage": "Alex"
    }
]
